 bibliography:~/Nutstore/bibliography/reference1.bib
*** 切换缓冲区   
(current-buffer)

(buffer-file-name)

(switch-to-buffer (other-buffer))

(buffer-size) 
(point)  


(point-min)
(point-max)
交互函数：
(defun multiply-by-seven (number)   ;version1
  "Multiply NUMBER by seven"
  (* 7 number))

(defun multiply-by-seven2 (number)  ;version2
  "Multiply NUMBER by seven"
  (interactive "p")
  (message "the result is %d" (* 7 number)))

(defun multiply-by-seven3 (buffer start end)  ;version3
  "Multiply NUMBER by seven"
  (interactive "BAppend to buffer: \nr"))
 ; (message "the result is %d" (* 7 number)))

3.6 let函数
(let ((zebra 'stripes)
      (tiger 'fierce))
  (message "One kind of animal has %s and anthor has %s."
	   zebra tiger))

3.7 if 函数

(if (> 4 5)
    (message "5 is greater than 4!")
  (message "4 is not greater than 5!"))

(defun type-of-animal (charac)
  "print message in echo area depending on charac"
  (if (equal charac 'tiger)
      (message "it is a tiger!")))
(type-of-animal 'tige)

(multiply-by-seven 7)
5


(if 4
    'true
  'false)







#+BEGIN_SRC emacs-lisp
(+ 2 3)

#+END_SRC 

#+RESULTS:
: 5


*** 第一章python版本书中程序

#+BEGIN_SRC python :results output
from operator import add,sub
import sys
print sys.version
print sys.prefix
print "hello world!"


#+END_SRC

#+RESULTS:
: 2.7.13 |Anaconda 4.3.1 (64-bit)| (default, Dec 19 2016, 13:29:36) [MSC v.1500 64 bit (AMD64)]
: d:\Anaconda2
: hello world!




** Org中插入参考文献doi信息 
  a reference from cite:Murray2009Hydrogen
   

  rowe-1979\cite{rowe-1979-grain}
  cite:rowe79_grain_bound_segreg_grain_growt
  restref cite:backeberg18_neoar_supra_subduc_gold_mesoar_tonal_granod
 
  test \cite{Ustinovskiy:2013:PWU:2541176.2505679}
   10.1007/bf02811646
  doi:10.1007/BF02811644

  doi:10.1111/gcbb.12488


  doi:10.1038/nature25456
  doi:10.1016/j.precamres.2017.12.016

  doi:10.1007/bf02811646
cite:backeberg18_neoar_supra_subduc_gold_mesoar_tonal_granod
  doi:10.1038/s41598-018-20716-3

  cite:rowe79_grain_bound_segreg_grain_growt

  ref document cite:Cao:2017:MEA:3134600.3134606
  
  Ei doi:10.1109/TNNLS.2015.2479223
  ei reference cite:He:2017:NFM:3077136.3080777
  cite:16406882
  cite:cao17_data_scien

cite:ye18_power_deep_learn_chann_estim
  doi:10.1109/lwc.2017.2757490


   cite:tu17_emacs
 


  #+BEGIN_LaTeX

   #+END_LaTeX

#+BEGIN_QUOTE

#+END_QUOTE

#+BEGIN_EXAMPLE

#+END_EXAMPLE

#+BEGIN_SRC C
  #include <stdio.h>
  int main(int argc, char *argv[])
  {
    printf("hello world!\n");
    return 0;
 
  }

#+END_SRC

#+RESULTS:
: hello world!

#+BEGIN_SRC C++
  #include <iostream>
  int main()
  {
  std::cout << "hello, c++ in emacs new!!"
            << std::endl;
  }


#+END_SRC

#+RESULTS:
| hello | c++ in emacs new!! |

